{"config": [{"config": {"arguments": {}, "output_shape_type": "raw", "batch_input_shape": [null, 200, 66, 3], "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>I\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": [200, 66, 3], "name": "lambda_1", "trainable": true}, "class_name": "Lambda"}, {"config": {"init": "he_normal", "border_mode": "same", "b_regularizer": null, "nb_row": 5, "nb_filter": 24, "trainable": true, "W_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "conv1", "b_constraint": null, "nb_col": 5, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"epsilon": 1e-05, "momentum": 0.99, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_1", "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"init": "he_normal", "border_mode": "same", "b_regularizer": null, "nb_row": 5, "nb_filter": 36, "trainable": true, "W_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "conv2", "b_constraint": null, "nb_col": 5, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"epsilon": 1e-05, "momentum": 0.99, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_2", "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"init": "he_normal", "border_mode": "same", "b_regularizer": null, "nb_row": 5, "nb_filter": 48, "trainable": true, "W_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "conv3", "b_constraint": null, "nb_col": 5, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"epsilon": 1e-05, "momentum": 0.99, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_3", "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"init": "he_normal", "border_mode": "same", "b_regularizer": null, "nb_row": 3, "nb_filter": 64, "trainable": true, "W_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "conv4", "b_constraint": null, "nb_col": 3, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"epsilon": 1e-05, "momentum": 0.99, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_4", "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"init": "he_normal", "border_mode": "same", "b_regularizer": null, "nb_row": 3, "nb_filter": 64, "trainable": true, "W_regularizer": null, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "conv5", "b_constraint": null, "nb_col": 3, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"epsilon": 1e-05, "momentum": 0.99, "mode": 0, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_5", "axis": -1, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "he_normal", "b_regularizer": null, "activation": "linear", "trainable": true, "W_constraint": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "name": "dense_1", "W_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"init": "he_normal", "b_regularizer": null, "activation": "linear", "trainable": true, "W_constraint": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "name": "dense_2", "W_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"init": "he_normal", "b_regularizer": null, "activation": "linear", "trainable": true, "W_constraint": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "name": "dense_3", "W_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"init": "he_normal", "b_regularizer": null, "activation": "linear", "trainable": true, "W_constraint": null, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "bias": true, "name": "output", "W_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}